[
  {
    "id": "1G23jA4DR-Y",
    "slug": "ksp20-totalitarismus",
    "videoId": "1G23jA4DR-Y",
    "url": "https://www.youtube.com/watch?v=1G23jA4DR-Y",
    "publishedAt": "2020-02-07T14:30:39Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nPrvním přednášejícím „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byl MUDr. Roman Joch se svou přednáškou „Totalitarismus coby nejradikálnější forma revoluce 20. století“.\n\nJeho přednáška se bude věnovat filosofickým předpokladům totalitarismu: etatismu, relativismu a utopismu. Bude se zamýšlet nad tím, jestli a jakého typu je totalitarismus coby náhradní náboženství.\n\nRoman Joch je ředitel Občanského institutu, publicista a komentátor, vyučuje na VŠ CEVRO Institut a na VŠE. Je autorem několika knih, mezi nimiž jsou i „Vzpoura proti revoluci 20. století“ a „Ne, pane premiére!“.",
    "duration": 3615,
    "name": "Totalitarismus",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Roman Joch"
    ],
    "lang": "cs"
  },
  {
    "id": "ajDtXzthTVc",
    "slug": "ksp20-ruzne-tvare-zla",
    "videoId": "ajDtXzthTVc",
    "url": "https://www.youtube.com/watch?v=ajDtXzthTVc",
    "publishedAt": "2020-02-07T18:02:03Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nDruhým přednášejícím „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byl Urza se svou přednáškou „Různé tváře zla aneb Rozpoznejte totalitu“.\n\nAč se snad všichni shodnou na tom, že nechtějí žít v totalitě, z nějakého důvodu jsou totalitní režimy neodmyslitelnou součástí naší historie; a to nejen dávno minulé, ale také celkem nedávné, zkrátka neustále přicházejí znovu a znovu. Ptáte se, jak je to možné, když téměř všichni totalitu odmítají? Inu, málokdo ji totiž nabídne lidem přímo; totalitní režimy typicky přicházejí pod rouškou slibů bezpečí, prosperity, blahobytu, a často dokonce i svobody. Historie bohužel ukazuje, že většina lidí totalitu nerozezná, dokud není příliš pozdě. A protože si nechce (snad nejen) Urza tuto historii zopakovat, během této přednášky se pokusí vás naučit rozpoznávat příchody totalitních režimů, dokud je ještě čas.\n\nUrza je anarchokapitalistický autor; napsal asi tisíc libertariánských textů na web i do tištěných médií a první českou knihu o anarchokapitalismu. O svobodě, etice, volném trhu, ekonomii a roli státu ve společnosti nejen přes deset let čte, přemýšlí a píše, ale též přednáší, natáčí videa a je zván do různých pořadů i panelových diskusí. Spolu s manželkou Terezou tvoří Svobodný přístav; vede český a slovenský Institut Ludwiga von Misese, jehož je spoluzakladatelem; patří do předsednictva spolku Svoboda učení a aktivně spolupracuje s mnoha libertariánskými iniciativami. Více o něm naleznete na stránkách Urza.cz.\n\nPrezentace ke stažení:\nhttps://prednasky.urza.cz/konference/2020.konftot.pdf",
    "duration": 3435,
    "name": "Různé tváře zla",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "urza"
    ],
    "lang": "cs"
  },
  {
    "id": "1EsHBxim4KQ",
    "slug": "ksp20-diktatura-vs-totalita",
    "videoId": "1EsHBxim4KQ",
    "url": "https://www.youtube.com/watch?v=1EsHBxim4KQ",
    "publishedAt": "2020-02-14T17:23:49Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nSpeciálním hostem „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byl řečník, Richard Vokoun s přednáškou „Diktatura versus totalita, surveillance - a kde je svoboda?“.\n\nKaždý historik vám popíše, jak fungovaly historické totality. Jak ale rozpoznat budoucí totalitní ideologie a jak je přežít? Jaký je zásadní rozdíl mezi totalitou a diktaturou? Může totalita vzniknout pouze skrze stát, nebo se reálně vyskytují i \"grasroots\" totality od tajných skupinek fanatiků?\nVe studiu totalit si postupně prošel od historického přes systémové, politologické, sociologické a psychologické hledisko a výsledkem je syntéza univerzálně platných principů fungování totalit.\n\nRichard Vokoun 15 let studuje totalitní režimy a ideologie, které za nimi stojí. Jeho profesí je analýza technických systémů a předvídání jejich rizik a selhání, ale tyto dovednosti používá i k připomínkování zákonů. V práci vidí „pod pokličku“ šmírovacích a dohledových systémů. Má i průřezové znalosti z bezpečnostních studií, historie a fungování tajných služeb a represivních orgánů, křesťanské a islámské teologie.",
    "duration": 3297,
    "name": "Diktatura vs. totalita",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Richard Vokoun"
    ],
    "lang": "cs"
  },
  {
    "id": "wEAOT4VmlDg",
    "slug": "ksp20-iluze-svobody",
    "videoId": "wEAOT4VmlDg",
    "url": "https://www.youtube.com/watch?v=wEAOT4VmlDg",
    "publishedAt": "2020-02-14T19:03:47Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nDalším neuvěřitelně poutavým řečníkem „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byla Lidija Zavoralová se svou přednáškou „Iluze svobody jako větší zlo versus totalita“.\n\nJak vůbec poznáme, co a kdy je totalita a kde totalita začíná? Příběh Lidije Zavoralové začíná už v jejích třinácti letech, když bojovala za shazování srbského socialistického režimu pod vládou Miloševiće. Osobně tiskla letáky a vyzývala celou školu, aby šla demonstrovat se studenty. Následně pak v 19 letech zjistila, že je v pasti, všechno bylo se svobodou jinak, než se jí zdálo, ale i přes tuto skepsi začala po roce studia v Americe pracovat pro tajné služby, dodávala jim informace a znovu myslela, že bojuje pro demokracii svého státu. V přednášce bude povídat i o tom, jaké konkrétní úkoly v rámci této své osobní mise dostávala.\n\nLidija Zavoralová je freedom-hacker, byznys konzultantka a spisovatelka dětských knížek.",
    "duration": 3182,
    "name": "Iluze svobody",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Lidija Zavoralová"
    ],
    "lang": "cs"
  },
  {
    "id": "qNK1MJ8KpBs",
    "slug": "ksp20-severni-korea",
    "videoId": "qNK1MJ8KpBs",
    "url": "https://www.youtube.com/watch?v=qNK1MJ8KpBs",
    "publishedAt": "2020-02-15T15:02:48Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nDalším řečníkem „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byl Jan Zugar se se svou přednáškou „Severní Korea – země mnohem více otevřená, než ji vnímáme“.\n\nNeexistuje pocitově snad více uzavřená země před okolním světem jako je Korejská lidově demokratická republika. V roce 1950-53 zde proběhla válka, při které se země rozdělila na jižní a severní část díky snaze severu, který usiloval za podpory Číny a Sovětského svazu sjednotit celou zemi pod rudou vlajkou. To se nepodařilo díky intervenci vojsk OSN, a tak po tříletém konfliktu byla Korea na tyto dvě části rozdělena 38. rovnoběžkou. Zatímco Jižní Korea je rozvojovou zemí, která jde stejným směrem jako srovnatelné orientální státy, Severní Korea je uzavřená, na média okolních zemí je uvaleno informační embargo, přístup k internetu, který je navíc interní pouze pro KLDR, je zde téměř nemožný a vládne zde tvrdá diktatura komunistické strany a klanu Kimů. Do této země se dá dostat velmi výjimečně v rámci diplomatických cest nebo studijního pobytu, což se podařilo právě Janu Zugarovi.\n\nJan Zugar je absolvent VUT v Brně, člen Mladých křesťanských demokratů a odpůrce komunismu.",
    "duration": 1997,
    "name": "Severní Korea",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Jan Zugar"
    ],
    "lang": "cs"
  },
  {
    "id": "TAjnaqa7r_A",
    "slug": "ksp20-socialni-tyranie",
    "videoId": "TAjnaqa7r_A",
    "url": "https://www.youtube.com/watch?v=TAjnaqa7r_A",
    "publishedAt": "2020-02-15T18:10:41Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nPřednáška Adama Růžičky pro „Konferenci Svobodného přístavu 2020: Totalita včera, dnes a zítra“ nesla název „Potutelná tyranie sociální a důležitost svobody slova“.\n\nPod pojmem tyranie se nám obvykle vyjeví přestava násilného diktátu jedince či skupiny mocných, jenž utlačuje zbytek. Avšak myslitelé již dlouho upozorňují na to, že tyranie se může projevovat i v rovině sociální, a to způsoby hůře definovatelnými, ale o to více zákeřnými, neboť nejsou jasně vidět, ale mají na život jedinců mnohdy srovnatelný vliv jako vlády despotů. Toto ohrožení svobodných společností popsal John Stuart Mill ve své slavné eseji O svobodě a dotkl se jí i Václav Havel v Moci bezmocných, když hovořil o společenské „samo-totalitě“. Přednáška uvede základní teze problematiky sociální svobody a propojí je s nedávnými výzkumy psychologie v kontextu současných výzev demokratických společností (e.g. sociální média, názorové bubliny, fenomén rozdělených společností, apod.).\n\nPo studiu psychologie na Masarykově univerzitě odešel Adam Růžička, MSc. MRes. na University College London, kde několik let působil jako badatel v oblasti kognitivní neurovědy a zkoumal mozek se zaměřením na lidskou řeč. V současnosti působí jako ředitel Institutu H21 v Praze, který se zaměřuje na kolektivní rozhodování, volební systémy, občanskou participaci a problematiku rozdělené společnosti.",
    "duration": 3280,
    "name": "Sociální tyranie",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Adam Růžička"
    ],
    "lang": "cs"
  },
  {
    "id": "PSTxWutKCTE",
    "slug": "ksp20-opt-out-ze-systemu",
    "videoId": "PSTxWutKCTE",
    "url": "https://www.youtube.com/watch?v=PSTxWutKCTE",
    "publishedAt": "2020-02-21T10:52:52Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nPosledním speakerem „Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra“ byl Palo Lupták se svou přednáškou „Opt-out ze systému: Jak dosáhnout ekonomické a osobní svobody využitím globality a flexibility“.\n\n1. Vyberte si vhodnou zemi pro vaši trvalou rezidenturu.\n2. Vyberte si vhodnou zemi jako sídlo pro vaši firmu.\n3. Odstraňte centra zájmu ve vaší domovské zemi.\n4. Zrušte si bankovní účet.\n5. Převeďte si finance do kryptoměn, preferujte ty opravdu anonymní, podporujte kryptoměnám přátelské služby.\n6. Vyberte si mezinárodní zdravotní pojištění.\n7. Vyberte si svého mezinárodního mobilního operátora.\n8. Podporujte sdílenou ekonomiku.\n9. Pomozte svým přátelům opt-outovat systém.\n\nPalo Lupták je kryptoanarchista a voluntaryista zaměřený na technologie a hackování společnosti. Je zakladatelem hackerských společností v oblasti IT bezpečnosti (Nethemba, Hacktrophy) a současného umění (Satori). Spoluzaložil bratislavský a pražský hackerspace (Progressbar a Paralelni Polis).",
    "duration": 3275,
    "name": "Opt-out ze systému",
    "project": "konference-sp",
    "event": "ksp20",
    "people": [
      "Palo Lupták"
    ],
    "lang": "cs"
  },
  {
    "id": "r4uoZ7YQpJ4",
    "slug": "ksp20-panelova-diskuse-konference-svobodneho-pristavu-2020-totalita-vcera-dnes-a-zitra",
    "videoId": "r4uoZ7YQpJ4",
    "url": "https://www.youtube.com/watch?v=r4uoZ7YQpJ4",
    "publishedAt": "2020-02-21T15:06:01Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3PQe6KG4Pb3digTC2HrtTDk5jun8PMgeNK\nLTC: LMsi1LfycXgNSaFb6N8UsP3E8L8DEfARQK\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nKonferenci Svobodného přístavu 2020: Totalita včera, dnes a zítra jsme zakončili panelovou diskusí, které se zúčastnil Richard Vokoun, Palo Lupták, Adam Růžička, Jan Zugar a Urza; ačkoliv se jedná o pět zastánců svobody, je zajímavé sledovat odlišnosti v jejich vnímání rizik hrozících naší společnosti a přístupu k řešešní existujících problémů.\n\nDěkujeme všem diskutujícím i ostatním řečníkům, všem posluchačům, podporovatelům (https://opristavu.urza.cz/), propagátorům, celému realizačnímu týmu a v neposlední řadě Josefu Šímovi a CEVRO Institutu, kde se celá akce konala.\n\nKompletní program konference naleznete zde:\nhttps://konference.urza.cz/2020/img/program.1024x1448.png",
    "duration": 5429,
    "name": "Panelová diskuse Konference Svobodného přístavu 2020: Totalita včera, dnes a zítra",
    "people": [],
    "lang": "cs",
    "project": "konference-sp",
    "event": "ksp20"
  }
]