[
  {
    "id": "lUvXBfCxOJ8",
    "slug": "ksp21-argumenty-pro-vnitrne-rizene-vzdelavani",
    "videoId": "lUvXBfCxOJ8",
    "url": "https://www.youtube.com/watch?v=lUvXBfCxOJ8",
    "publishedAt": "2021-09-25T09:43:25Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nPrvní přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byla PhDr. Jana Nováčková, CSc. se svou přednáškou „Psychologické argumenty pro vnitřně řízené vzdělávání“.\n\nUspokojování základních i vývojových potřeb je předpoklad pro zdravý vývoj dětí. Způsob uspokojování je však velmi různorodý a individuálaní, takže zvenku řízené vzdělávání nemá z podstaty věci šanci u většiny dětí jejich potřeby uspokojovat. Naopak vzdělávání, které si řídí děti samy, nejen uspokojuje jejich potřeby, ale také naplňuje požadavek smysluplnosti, bez níž není možné udržet vnitřní motivaci.\n\nJana Nováčková je psycholožka a publicistka s letitou praxí v poradenství i psychologickém výzkumu. Je spoluautorkou konceptu Respektovat a být respektován a stejnojmenné knihy i kurzů. Autorka publikace Mýty ve vzdělávání. Od r. 1994 se věnuje lektorské a přednáškové činnosti. Desítky jejích článků či vystoupení jsou přístupné na www.respektovani.com v sekci Články. Patří ke kritikům současného školství.",
    "duration": 3570,
    "name": "Argumenty pro vnitřně řízené vzdělávání",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "Jana Nováčková"
    ],
    "lang": "cs"
  },
  {
    "id": "sB-STIfXYWA",
    "slug": "ksp21-deti-jsou-taky-lidi",
    "videoId": "sB-STIfXYWA",
    "url": "https://www.youtube.com/watch?v=sB-STIfXYWA",
    "publishedAt": "2021-09-26T09:34:27Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nDruhou přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byla Zdeňka Šíp Staňková se svou přednáškou „Děti jsou taky lidi“.\n\nZdeňka se s vámi může podělit o zážitky a zkušenosti ze života matky jednoho čerstvého vysokoškoláka, třináctileté unschoolerky a jednoho batolete. Může povídat i o 8 letech ve Svobodě učení, o několika rocích práce s dětmi v kroužcích a ve školce, o sedmileté domškolácké střídavce, jednom pokusu o komunitní školu a také třeba o natáčení celovečerního dokumentu o sebeřízeném vzdělávání, na němž se právě podílí.\n\nZdeňka Šíp Staňková má 3 děti, blog a YouTube kanál DĚTI JSOU TAKY LIDI. Žije (nejen s dětmi) unschooling, worldschooling, sebeřízené vzdělávání, svobodu, dobrovolnost a vztahy naplněné respektem a úctou. Kromě toho propaguje informovanost v oblasti práv dětí a rodičů ve vzdělávání (FB skupina Řešení problémů ve škole, stížnosti na učitele a školy) a od roku 2012 se podílela na rozvoji iniciativy SvobodaUčení.cz. Také spolupracuje na natáčení celovečerního dokumentárního filmu Svobodné děti. Miluje svobodu, Pipi Dlouhou punčochu, cestování a zmrzlinu.",
    "duration": 3442,
    "name": "Děti jsou taky lidi",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "Zdeňka Šíp Staňková"
    ],
    "lang": "cs"
  },
  {
    "id": "mKA6m5Uk2K8",
    "slug": "ksp21-sraz-v-jezkovi-bez-klece",
    "videoId": "mKA6m5Uk2K8",
    "url": "https://www.youtube.com/watch?v=mKA6m5Uk2K8",
    "publishedAt": "2021-10-02T09:38:10Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nTřetí přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byla Gabriela Ježková se svou přednáškou „Sraz v Ježkovi bez klece“.\n\nV besedě o Ježkovi bez klece se dozvíte, jak to tam chodí, jaké jsou základní principy, jak to mají s tou svobodou, co (ne)chtějí, co (ne)mohou, co (ne)potřebují. Dotazům bude věnován dostatečný prostor. Gabriela se těší na společnou diskuzi s vámi!\n\nGabriela se narodila v Brně, kde vystudovala gymnázium a následně učitelství pro druhý stupeň, na který navázala studiem speciální pedagogiky. Již od mládí doučovala mladší děti, objížděla rodiny a bylo jí smutno z toho, co si v souvislosti se vzděláváním prožívají. Při studiu začala učit na brněnské základní škole, kde si vyzkoušela, jaké to je stát ve třídě před jen o pár let mladšími lidmi a snažit se do nich nahustit, co je podle někoho jiného třeba. Vše se jí postupně skládalo a po narození dvou dětí se rozhodla, že založí školu vlastní. O Ježkovi bez klece mluví jako o škole tak svobodné, jak to naše současná školská legislativa dovoluje. Ráda by se jednou dožila zásadních změn, které naprosto každému umožní žít skutečně svobodný život.",
    "duration": 3472,
    "name": "Sraz v Ježkovi bez klece",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "Gabriela Ježková"
    ],
    "lang": "cs"
  },
  {
    "id": "pfQE7sri_v8",
    "slug": "ksp21-lze-v-cesku-vychovavat-deti-ke-svobode",
    "videoId": "pfQE7sri_v8",
    "url": "https://www.youtube.com/watch?v=pfQE7sri_v8",
    "publishedAt": "2021-10-03T09:46:05Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nČtvrtá přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byla Krkavčí matka se svou přednáškou „Je možné v Česku vychovávat děti ke skutečné svobodě?“.\n\nJe možné v Česku vychovávat děti ke skutečné svobodě, aby si dokázaly řídit svůj život samy? Veronika se rozhodla, že to zkusí. Její tři děti nechodí do školy a ve vzdělávání se jim snaží poskytnout maximální volnost. Společně tráví pět měsíců z roku na cestách v zahraničí a učí se tím, že prostě žijí.\n\nVždycky jsem byla ve spoustě věcí „ta divná“. Narozdíl od svého 15letého já se za to dnes už nestydím. Mám víc dětí než rukou. Gréta, Marián a Janek se jmenují. Ty děti, ne ruce. Když děti spí, píšu blog Krkavčí matka. A protože jsou všichni tři dobří spáči po mamince, napsala jsem po nocích ještě 13 knížek pro dospěláky i pro děti. Miluju les, nohy v teple a mého muže Honzu, který na mě čeká v nebi. Děsí mě pobytové zájezdy, snahy o škatulkování a nesmířliví lidé se zavřenými hlavami.",
    "duration": 2583,
    "name": "Lze v Česku vychovávat děti ke svobodě?",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "Krkavčí matka"
    ],
    "lang": "cs"
  },
  {
    "id": "w_k14q4HKMc",
    "slug": "ksp21-skola-ustav-nesvobody-a-poslusnosti",
    "videoId": "w_k14q4HKMc",
    "url": "https://www.youtube.com/watch?v=w_k14q4HKMc",
    "publishedAt": "2021-10-09T09:45:44Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nPátou přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byla Zuzana Candigliota se svou přednáškou „Škola – ústav nesvobody, poslušnosti a konformity“.\n\nBohulibý cíl vzdělávání je státem degradován na docházku do státních ústavů, které jsou typické nesvobodou, vynucováním si poslušnosti a konformity. Příspěvek se zaměří na konkrétní příklady a kauzy týkající se práv dětí a rodičů ve školství, například: Ztrácí dítě vstupem do školy právo na osobní kontakt s rodičem? Může škola dětem zakazovat mobilní telefony a pořizování nahrávek? Kde je hranice mezi přísným přístupem pedagoga a ponižováním a šikanou dítěte? Jak se mohou děti a rodiče bránit?\n\nZuzana jako právnička i ve svém soukromém životě prosazuje svobodu a odpovědnost každého jednotlivce za sebe a svou rodinu, méně státních zásahů do lidských životů a respekt k individualitě každého jednotlivce. Působí v Lize lidských práv i jako samostatná advokátka. Zaměřuje se na právní obranu jednotlivců, zejména dětí, rodičů a pacientů, proti zásahům institucí a státu, aktuálně zejména proti nepřiměřeným opatřením v souvislosti s covidem. Založila poradenskou FB skupinu Práva dětí a rodičů v kontaktu se zdravotnictvím, školstvím a státem.",
    "duration": 1518,
    "name": "Škola – ústav nesvobody a poslušnosti",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "Zuzana Candigliota"
    ],
    "lang": "cs"
  },
  {
    "id": "Glq0nHOffnE",
    "slug": "ksp21-svoboda-uceni",
    "videoId": "Glq0nHOffnE",
    "url": "https://www.youtube.com/watch?v=Glq0nHOffnE",
    "publishedAt": "2021-10-10T09:34:38Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nŠestý přednášející „Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení…“ s podtitulem „…protože láska v učení je vrozená každému“ byl Urza se svou přednáškou „Svoboda učení“.\n\nSebeřízené vzdělávání (unschooling) není v ČR legální; a má to svůj důvod. Proč stát drží a odmítá pustit monopol na násilí? Jsem přesvědčen, že to souvisí s jeho propagandou, jíž jsou masivně indoktrinovány děti ve školách. Jaké to má důsledky?\n\nUrza je anarchokapitalistický autor; napsal asi tisíc libertariánských textů na web i do tištěných médií a první českou knihu o anarchokapitalismu. O svobodě, etice, volném trhu, ekonomii a roli státu ve společnosti nejen přes deset let čte, přemýšlí a píše, ale též přednáší, natáčí videa a je zván do různých pořadů i panelových diskusí. Spolu s manželkou Terezou tvoří Svobodný přístav; vede český a slovenský Institut Ludwiga von Misese, jehož je spoluzakladatelem; patří do předsednictva spolku Svoboda učení a aktivně spolupracuje s mnoha libertariánskými iniciativami. Více o něm naleznete na stránkách Urza.cz.",
    "duration": 2633,
    "name": "Svoboda učení",
    "project": "konference-sp",
    "event": "ksp21",
    "people": [
      "urza"
    ],
    "lang": "cs"
  },
  {
    "id": "GGYGJtHWzjk",
    "slug": "ksp21-panelova-diskuse-konference-svobodneho-pristavu-2021-jak-podporit-deti-v-lasce-k-uceni",
    "videoId": "GGYGJtHWzjk",
    "url": "https://www.youtube.com/watch?v=GGYGJtHWzjk",
    "publishedAt": "2021-10-16T09:46:00Z",
    "desc": "Chcete-li podpořit tuto i další Konference Svobodného přístavu, prosím, pošlete dobrovolný příspěvek v krypto či korunách!\nBTC: 3QLRtD5JGJsaFj8wfZcYk5dkinwKFHa1M1\nLTC: LT26FkAGvYXvpH8f51nNRtEcVP3Z7Wx6t8\nČíslo účtu: 2201359764/2010; variabilní symbol: 5\n--------\nKonferenci Svobodného přístavu 2021: Jak podpořit děti v lásce k učení s podtitulem „…protože láska k učení je vrozená každému“ jsme zakončili panelovou diskusí, které se zúčastnili všichni řečníci (jen místo Urzy vystoupila Tereza).\n\nDěkujeme všem diskutujícím, posluchačům, podporovatelům (https://opristavu.urza.cz/), propagátorům, celému realizačnímu týmu a v neposlední řadě Josefu Šímovi a CEVRO Institutu, kde se celá akce konala.\n\nKompletní program konference naleznete zde:\nhttps://konference.urza.cz/2021/img/program.724x1024.png",
    "duration": 4636,
    "name": "Panelová diskuse Konference Svobodného přístavu 2021: Jak podpořit děti v lásce k učení",
    "people": [],
    "lang": "cs",
    "project": "konference-sp",
    "event": "ksp21"
  }
]