[
  {
    "id": "71EeTJDkQOQ",
    "slug": "anarchokapitalismus-dil-prvni-stat-je-nemoralni",
    "videoId": "71EeTJDkQOQ",
    "url": "https://www.youtube.com/watch?v=71EeTJDkQOQ",
    "publishedAt": "2016-12-09T05:46:13Z",
    "desc": "Přijďte si poslechnout úvodní přednášku z cyklu Anarchokapitalismus! Popovídáme si o financování státu a daních; podrobíme kritice koncept daní a jejich vybírání z hlediska etiky. Do důsledků promyslíme, co je v pozadí každé regulace i každého zákona; jak lze morálně ospravedlnit jejich násilné vynucování ze strany policie? A nakonec si řekneme něco o státní propagandě a indoktrinaci; důvodech, proč si stát v podstatě může dělat, cokoliv se mu zachce.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 4362,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl první: Stát je nemorální"
  },
  {
    "id": "UEa1uow2e7c",
    "slug": "anarchokapitalismus-dil-druhy-stat-je-spatny-sluha-ale-zly-pan",
    "videoId": "UEa1uow2e7c",
    "url": "https://www.youtube.com/watch?v=UEa1uow2e7c",
    "publishedAt": "2017-01-02T17:00:02Z",
    "desc": "Na první přednášce z cyklu Anarchokapitalismus jsme se bavili o tom, proč je stát nemorální. Přijďte si na druhou přednášku poslechnout, proč je stát ještě navíc neefektivní. Anarchokapitalismus stojí na dvou hlavních pilířích – přirozeném právu a rakouské ekonomické škole, jejíž základy budou na přednášce představeny. Nečekejte však suché povídání o ekonomii, vše si ukážeme na příkladech z reálného světa – proč například špičkový fotbalista vydělává více než hasič, jenž zachraňuje životy?\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5031,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl druhý: Stát je špatný sluha, ale zlý pán"
  },
  {
    "id": "kc6EQ8pgOqc",
    "slug": "anarchokapitalismus-dil-treti-penize",
    "videoId": "kc6EQ8pgOqc",
    "url": "https://www.youtube.com/watch?v=kc6EQ8pgOqc",
    "publishedAt": "2017-01-20T15:29:06Z",
    "desc": "Na této přednášce z cyklu Anarchokapitalismus se máte možnost dozvědět a následně podiskutovat o nejdůležitější a naprosto fascinující funkci peněz a cen, která z nich bez nadsázky dělá jeden z nejdůležitějších objevů v historii lidstva. Povídat si budeme i o tom, jak státy svými zásahy tento úžasný objev postupně znehodnocují. Budete si moci udělat představu o frakčním bankovnictví a zjistit, proč a jak státy skrze banky způsobují cyklické hospodářské krize.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5565,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl třetí: Peníze"
  },
  {
    "id": "oTGExJzeiJA",
    "slug": "anarchokapitalismus-dil-ctvrty-hasici",
    "videoId": "oTGExJzeiJA",
    "url": "https://www.youtube.com/watch?v=oTGExJzeiJA",
    "publishedAt": "2017-02-02T15:24:08Z",
    "desc": "Na další přednášce z cyklu Anarchokapitalismus budeme probírat, proč a jak by mohli na volném trhu fungovat hasiči; z jakého důvodu by tuto službu neměl poskytovat stát? Byly by i na volném trhu garantovány maximální dojezdové časy pro řidčeji zalidněné oblasti? Nezachraňovali by hasiči z hořících domů pouze platící zákazníky a nenechávali ostatní zhynout v plamenech? Po přednášce bude jako vždy možnost diskuse.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5040,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl čtvrtý: Hasiči"
  },
  {
    "id": "avtW9X8ogBU",
    "slug": "anarchokapitalismus-dil-paty-kultura",
    "videoId": "avtW9X8ogBU",
    "url": "https://www.youtube.com/watch?v=avtW9X8ogBU",
    "publishedAt": "2017-02-18T00:08:29Z",
    "desc": "Tématem této přednášky z cyklu Anarchokapitalismus bude kultura a umění v rukou státu a jak by mohly fungovat bez něj na volném trhu; ačkoliv je většina lidí přesvědčna o nezbytnosti role státu v této oblasti, domnívám se, že věci zdaleka nejsou tak jednoznačné. Krom tvorby nového umění se budeme věnovat i ochraně již existujících uměleckých děl a kulturních památek; lze i tohle zajišťovat tržně? Po přednášce bude jako vždy příležitost k diskusi.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6660,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl pátý: Kultura"
  },
  {
    "id": "bpF7sPNbNyU",
    "slug": "anarchokapitalismus-dil-sesty-demokracie",
    "videoId": "bpF7sPNbNyU",
    "url": "https://www.youtube.com/watch?v=bpF7sPNbNyU",
    "publishedAt": "2017-03-01T19:36:08Z",
    "desc": "Tématem šesté přednášky z cyklu Anarchokapitalismus bude demokracie, její škodlivost, ale také zamyšlení nad tím, proč je tato tolik zbožšťována a naopak její kritika považována za něco tak nepatřičného; popovídáme si i o tom, proč demokracie zcela zákonitě vede k socialismu a jakým způsobem podporou nezodpovědných tvoříme další nezodpovědné. Po přednášce bude jako vždy následovat mnou tolik oblíbená diskuse; přijďte a vezměte s sebou i své známé, o kterých se domníváte, že by je toto kontroverzní téma mohlo zajímat.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 8992,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl šestý: Demokracie"
  },
  {
    "id": "5J8WdVjz60U",
    "slug": "anarchokapitalismus-dil-sedmy-skolstvi",
    "videoId": "5J8WdVjz60U",
    "url": "https://www.youtube.com/watch?v=5J8WdVjz60U",
    "publishedAt": "2017-03-16T06:31:15Z",
    "desc": "Tuto přednášku považuji za nejdůležitější z celého cyklu o Anarchokapitalismu; povídat si budeme o státním vzdělávacím systému coby mocném nástroji využívanému k masivnímu šíření státní propagandy. Budeme rozkrývat kořeny i dopady toho, jak současné školství funguje. Samozřejmě nebude chybět ani náhled na to, jak (a proč) by mohlo (a mělo) vzdělávání probíhat volnotržně; a tentokrát nezůstaneme jen u toho, proč by to nebyla taková hrůza, jak většina lidí předpokládá, nýbrž se podíváme i na původ těch předpokladů samotných. Po přednášce bude jako vždy následovat diskuse, kde zodpovím všechny vaše dotazy a námitky. Tentokrát určitě přijďte!\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 7239,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl sedmý: Školství"
  },
  {
    "id": "HM73OQxgX9g",
    "slug": "anarchokapitalismus-dil-osmy-drogy",
    "videoId": "HM73OQxgX9g",
    "url": "https://www.youtube.com/watch?v=HM73OQxgX9g",
    "publishedAt": "2017-03-30T10:06:41Z",
    "desc": "Na osmé přednášce z cyklu Anarchokapitalismus si budeme povídat a diskutovat o drogách; jednak se budeme bavit o drogách samotných, ale především o vztahu státu k nim a naší svobodě nakládat s vlastním tělem dle svého uvážení. Probírat budeme také válku proti drogám, která zuří již dlouhá desetiletí; co nás vlastně stála a jaké má výsledky? Po přednášce bude již tradičně následovat diskuse, ve které se s radostí pokusím zodpovědět všechny otázky, které mi položíte.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5760,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl osmý: Drogy"
  },
  {
    "id": "kgAJvVtIWVE",
    "slug": "anarchokapitalismus-dil-devaty-zbrane",
    "videoId": "kgAJvVtIWVE",
    "url": "https://www.youtube.com/watch?v=kgAJvVtIWVE",
    "publishedAt": "2017-04-13T23:59:38Z",
    "desc": "Tématem deváté přednášky z cyklu Anarchokapitalismus budou zbraně a jejich regulace; povíme si o tom, k čemu vede odzbrojování společnosti a v čem se především liší společenství lidí se zbraněmi a bez nich. Ohlédneme se i do historie a zaměříme se na dobu a místo, kdy a kde byly zbraně prakticky neregulované; jaké to mělo důsledky? Přednášku jako vždy zakončí diskuse, ve které se budete moci na cokoliv zeptat a ideálně mi i oponovat.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5918,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl devátý: Zbraně"
  },
  {
    "id": "EeXSGthWoe4",
    "slug": "anarchokapitalismus-dil-desaty-verejny-prostor-a-svoboda-slova",
    "videoId": "EeXSGthWoe4",
    "url": "https://www.youtube.com/watch?v=EeXSGthWoe4",
    "publishedAt": "2017-05-13T12:17:40Z",
    "desc": "Na desáté přednášce z cyklu Anarchokapitalismus se budeme věnovat veřejným prostranstvím a místům „pro všechny“; jak by mohly takové prostory existovat v bezstátní společnosti založené na respektu k vlastnickým právům? Kdo by je spravoval, proč a za co? Zanikly by ve městech všechny parky? Žili bychom v betonových džunglích bez kousku zeleně? Krom toho si budeme povídat o svobodě slova; jak ta s tématem souvisí? Ukážeme si, že velice těsně. Po přednášce bude jako vždy následovat diskuse; doufám, že mi budete oponovat!\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6708,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl desátý: Veřejný prostor a svoboda slova"
  },
  {
    "id": "mzkxBZK8o9U",
    "slug": "anarchokapitalismus-dil-jedenacty-kdo-by-stavel-silnice",
    "videoId": "mzkxBZK8o9U",
    "url": "https://www.youtube.com/watch?v=mzkxBZK8o9U",
    "publishedAt": "2017-05-25T19:39:50Z",
    "desc": "„Kdybychom neměli stát, kdo by stavěl silnice?“ Tak zní nejčastější otázka v libertariánských vtipech a jedna z prvních reakcí etatistů na zmínku o bezstátní společnosti; právě tuto otázku se chystám na přednášce zodpovědět. A nejen to! Povídat si budeme i o pravidlech silničního provozu; lišily by se tyto cestu od cesty, kdyby měla každá pozemní komunikace svého soukromého vlastníka? Po přednášce bude jako vždy (snad bouřlivá) diskuse; těším se na vás, zejména pokud se mnou nesouhlasíte!\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6685,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl jedenáctý: Kdo by stavěl silnice?"
  },
  {
    "id": "QkV8JQSqp9k",
    "slug": "anarchokapitalismus-dil-dvanacty-socialni-system",
    "videoId": "QkV8JQSqp9k",
    "url": "https://www.youtube.com/watch?v=QkV8JQSqp9k",
    "publishedAt": "2017-10-28T11:48:24Z",
    "desc": "Bez státu by nebylo nejen sociálních dávek a podpory v nezaměstnanosti, ale především by neexistoval ani důchodový systém, jak jej známe teď. Co by to znamenalo? Umírali by ve volnotržní společnosti chudí na ulicích hlady? Co by si bez státu počali staří lidé? Tyto a mnohé další otázky se chystám zodpovědět na dvanácté přednášce z cyklu Anarchokapitalismus; následně se o těchto tématech můžeme bavit v diskusi.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6931,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl dvanáctý: Sociální systém"
  },
  {
    "id": "C47PcCkhRqA",
    "slug": "anarchokapitalismus-dil-trinacty-trh-prace",
    "videoId": "C47PcCkhRqA",
    "url": "https://www.youtube.com/watch?v=C47PcCkhRqA",
    "publishedAt": "2017-11-25T10:56:38Z",
    "desc": "Myslíte si, že bez státu a jeho regulací by zaměstnanci neměli žádného zastání, takže by je zaměstnavatelé mohli dřít z kůže? V tom případě je tato přednáška právě pro vás! Ukážeme si, proč by volný a neregulovaný trh práce zaměstnancům nejen neuškodil, ale naopak by jejich situaci v mnoha ohledech zlepšil; stát totiž svou „ochranou“ poskytuje zaměstnancům tak trochu medvědí službou. Nahlédnout, jak přesně a proč tomu tak je, není vůbec tak složité; stačí přijít na přednášku, kde si budeme mimo jiné povídat i o dětské práci a mnoha dalších zajímavých věcech.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5303,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl třináctý: Trh práce"
  },
  {
    "id": "fuKJlOAmB04",
    "slug": "anarchokapitalismus-dil-ctrnacty-zdravotnictvi",
    "videoId": "fuKJlOAmB04",
    "url": "https://www.youtube.com/watch?v=fuKJlOAmB04",
    "publishedAt": "2017-12-09T17:38:36Z",
    "desc": "Když se řekne „volnotržní zdravotnictví“, většinu lidí hned napadnou horentní částky za lékařské úkony, které si běžný smrtelník nemůže prostě dovolit platit, takže mu nezbývá než žít v nemoci; nebo dokonce umřít. Jak bychom si bez státu mohli dovolit platit za lékařskou péči? Kdo by dohlížel na kvalitu? Jak tržně překonat obrovskou informační asymetrii mezi lékařem a pacientem? Není volnotržní zdravotnictví asociální a hrůzný systém, skrze který mohou mocní ždímat bezmocné a nemocné? Odpovědi na tyto a mnohé další otázky se dozvíte, když přijdete na přednášku; a v následné diskusi pak můžete položit i vlastní dotazy.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6031,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl čtrnáctý: Zdravotnictví"
  },
  {
    "id": "jZZapCCYHL4",
    "slug": "anarchokapitalismus-dil-patnacty-zivotni-prostredi",
    "videoId": "jZZapCCYHL4",
    "url": "https://www.youtube.com/watch?v=jZZapCCYHL4",
    "publishedAt": "2017-12-23T10:21:20Z",
    "desc": "Potřebujeme státy, abychom nezdevastovali přírodu a životní prostředí? Bude-li naše společnost „řízena“ jen a pouze volnotržně, zanecháme našim potomkům více než jen zamořenou vodu, vzduch i půdu? Kdo by bez státu chránil ohrožené živočišné druhy? A jak bez státu prosadit trvale udržitelný rozvoj? K vysvětlování této zajímavé problematiky budu notně užívat poznatků rakouské ekonomické školy, které jsme (většinou opakovaně) rozebírali v předchozích přednáškách; vřele doporučuji si je znovu osvěžit.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5612,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl patnáctý: Životní prostředí"
  },
  {
    "id": "ZUfWlr-Hqek",
    "slug": "anarchokapitalismus-dil-sestnacty-soudnictvi",
    "videoId": "ZUfWlr-Hqek",
    "url": "https://www.youtube.com/watch?v=ZUfWlr-Hqek",
    "publishedAt": "2018-01-06T11:21:42Z",
    "desc": "Jak by mohl volný trh bez států zajišťovat fungující soudnictví? Kdo by jmenoval soudce? A bylo by možné se proti rozsudku odvolat? Lze vůbec nějak předejít tomu, aby soudy nestranily bohatým a majetným klientům? Tyto – a mnohé další – otázky se během přednášky pokusím zodpovědět; především se však dostaneme k tomu nejzajímavějšímu: Podle čeho by soudy rozhodovaly, kdyby neexistovala žádná centrální autorita s monopolem na zákonodárství? Tato přednáška patří ke třem „nejpokročilejším“ z celého cyklu a představuje jablko (v současnosti poněkud zbytečného) sváru mezi anarchokapitalisty a minarchisty; tak si ji nenechte ujít.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6374,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl šestnáctý: Soudnictví"
  },
  {
    "id": "8B8UZgsABl4",
    "slug": "krest-knihy-anarchokapitalismus",
    "videoId": "8B8UZgsABl4",
    "url": "https://www.youtube.com/watch?v=8B8UZgsABl4",
    "publishedAt": "2018-03-02T07:14:09Z",
    "desc": "Něco, čemu věřím, se mým přičiněním stalo reálnějším a hmatatelnějším; to jsem mohl oslavit po boku své milované ženy, obklopen lidmi, kteří věří ve stejné ideály, mírumilovně se podílejí na jejich prosazování, a bez nichž by se nikdy nemohlo stát to, co se právě děje, neboť bez jejich tvrdé práce a podpory by všechno mé úsilí neznamenalo vůbec nic. Díky; díky Vám všem.\nPrezentace: https://prednasky.urza.cz/ankup/\n\n– Tereza Sladkovská (budoucí Urzová xD); tvůrce Svobodného přístavu; hlava Institutu Ludwiga von Misese; členka Students for Liberty\n– Urza (www.urza.cz); autor knihy Anarchokapitalismus; tvůrce Svobodného přístavu; spoluzakladatel a hlava Institutu Ludwiga von Misese; člen předsednictva Svobody učení",
    "duration": 2760,
    "people": [
      "urza"
    ],
    "name": "Křest knihy Anarchokapitalismus"
  },
  {
    "id": "CwJCtHGBglE",
    "slug": "anarchokapitalismus-dil-sedmnacty-vymahani-prava",
    "videoId": "CwJCtHGBglE",
    "url": "https://www.youtube.com/watch?v=CwJCtHGBglE",
    "publishedAt": "2018-03-10T10:05:58Z",
    "desc": "Jestli byla přednáška o soudnictví kontroverzní, pro vymáhání práva to platí dvojnásob. Zatímco minule jsme se zabývali pouze spory, v nichž obě strany více méně spolupracují, tentokrát se budeme bavit o případech kriminálníků a desperátů, kteří porušují vlastnická práva a výkonu spravedlnosti se snaží aktivně vyhnout. Jak si s nimi volný trh poradí? Není zde už stát doopravdy zapotřebí? Tato přednáška patří ke třem „nejpokročilejším“ z celého cyklu a představuje jablko (v současnosti poněkud zbytečného) sváru mezi anarchokapitalisty a minarchisty; tak si ji nenechte ujít.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6962,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl sedmnáctý: Vymáhání práva"
  },
  {
    "id": "v3KgBb6mmS0",
    "slug": "anarchokapitalismus-dil-osmnacty-armada",
    "videoId": "v3KgBb6mmS0",
    "url": "https://www.youtube.com/watch?v=v3KgBb6mmS0",
    "publishedAt": "2018-03-24T08:41:11Z",
    "desc": "Jakkoliv je volnotržní zajišťování spravedlnosti a vnitřní bezpečnosti těžké téma, obrana proti vnějšímu nepříteli a potažmo mezinárodní vztahy představují asi zdaleka největší výzvu pro bezstátní anarchokapitalistickou společnost. Dokáží se svobodní lidé bez státu ubránit agresivním dobyvatelům? A pokud ne, co se pak bude odehrávat na dobytém území? Jak se liší ovládnutí dobytého anarchistického území od ovládnutí dobytého státu? Může společnou bez státu obstát? Minarchisté tomu nevěří; anarchokapitalisté ano. Nenechte si ujít přednášku s diskusí na toto zajímavé téma.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 5277,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl osmnáctý: Armáda"
  },
  {
    "id": "P1gX-a8bud8",
    "slug": "anarchokapitalismus-dil-devatenacty-v-sirsim-kontextu",
    "videoId": "P1gX-a8bud8",
    "url": "https://www.youtube.com/watch?v=P1gX-a8bud8",
    "publishedAt": "2018-04-15T08:00:02Z",
    "desc": "Jakým způsobem dojít od obrovského všežravého státu k anarchokapitalismu? A kudy cesta rozhodně nevede? I o tom si budeme povídat na poslední regulérní přednášce tohoto cyklu. Mnozí z vás si správně všimli, že většina přednášek byla „na jedno brdo“ v tom smyslu, že se jednalo o aplikaci téhož principu na různá odvětví lidské činnosti. Tento princip bych rád objasnil a formuloval obecně; zejména pro ty, kdo jej nepostřehli. A konečně zasadíme anarchokapitalismus do nějakého kontextu ostatních anarchistických škol, kterých je celá řada a o nichž určitě ještě mnoho uslyšíte.\nPřednáší Urza (www.urza.cz).\nPrezentace: https://prednasky.urza.cz/ankup/",
    "duration": 6474,
    "people": [
      "urza"
    ],
    "name": "Anarchokapitalismus, díl devatenáctý: V širším kontextu…"
  }
]