[
  {
    "id": "WyR_Qrp36Eg",
    "slug": "hcpp24-beyond-the-great-firewall-global-frontiers-in-privacy-tech",
    "videoId": "WyR_Qrp36Eg",
    "url": "https://www.youtube.com/watch?v=WyR_Qrp36Eg",
    "publishedAt": "2024-11-12T11:26:52Z",
    "desc": "This talk explores cutting-edge privacy technologies emerging in response to worldwide digital surveillance and control. Starting with China's digital landscape, we'll expand to examine global challenges and solutions in the fight for online privacy and free speech.\n\nWe'll analyze the evolving ecosystem of privacy-preserving tools and techniques, showing how innovations sparked by restrictive environments can be applied globally. Our goal is to provide actionable insights for privacy advocates, developers, and users facing various threats to digital freedom.\nThroughout the talk, we'll draw connections between privacy challenges and solutions across various global contexts. We'll examine how techniques developed in response to China's digital environment can be adapted worldwide. Brazil's attempts to regulate social media and France's stringent data protection laws will serve as additional case studies, highlighting the universal nature of the struggle for digital rights.\n\nWe'll explore how platforms like Signal navigate the complex landscape of global regulations while implementing features such as end-to-end encryption. The discussion will touch on the challenges faced by founders and companies in this space, illustrating the real-world complexities of operating global communication platforms in diverse regulatory environments.\n\n",
    "duration": 3266,
    "name": "Beyond the Great Firewall: Global Frontiers in Privacy Tech",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "yisi-liu"
    ],
    "storage": {
      "id": "WyR_Qrp36Eg",
      "path": "/videos/all/WyR_Qrp36Eg",
      "duration": "3265.301",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/WyR_Qrp36Eg/source.mp4",
        "hash": "ca246af4b7147ff37fab8b11c5632c26ae2dd42c55dffef52e74c76006a283b9",
        "size": 257473628,
        "resolution": "1920x1080",
        "bitrate": "630811",
        "videoCodec": "avc1",
        "videoBitrate": 507151,
        "audioCodec": "Opus",
        "audioBitrate": 118853
      }
    }
  },
  {
    "id": "G9eNq5o_23Y",
    "slug": "hcpp24-part-ii-the-dehumanizing-process-of-immigration-systems",
    "videoId": "G9eNq5o_23Y",
    "url": "https://www.youtube.com/watch?v=G9eNq5o_23Y",
    "publishedAt": "2024-11-12T11:30:06Z",
    "desc": "At HCPP19, Travin Keith spoke about the broken and dehumanizing immigration systems around the world through his first-had experience as well as some relevant data uncovered as he tried to find a new home in the world. Now, 5 years later and having gained a new passport, among other things, he has solved many problems, encountered new ones, and deals with some of the same ones he had before. However, the problems that he solved were only for himself and the greater problem remains. This talk will go over what he's done and why he's done it, as well as some additional information gained along the way that may be helpful for those seeking to expand their flag theory footprint. For those who attended his talk in 2019, he will also address discuss immigration issues he had to address with 2 more countries that he did not get to go over in 2019.\n\n",
    "duration": 3208,
    "name": "Part II: The Dehumanizing Process of Immigration Systems",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "travin-keith"
    ],
    "storage": {
      "id": "G9eNq5o_23Y",
      "path": "/videos/all/G9eNq5o_23Y",
      "duration": "3207.681",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/G9eNq5o_23Y/source.mp4",
        "hash": "1bc05cb3e49357a7d8c7e7688f453f1c9a7b0967c3b464dd1ed05fa1ecb7e6f2",
        "size": 167645106,
        "resolution": "1920x1080",
        "bitrate": "418109",
        "videoCodec": "avc1",
        "videoBitrate": 286595,
        "audioCodec": "Opus",
        "audioBitrate": 126686
      }
    }
  },
  {
    "id": "TFasLWSk-rI",
    "slug": "hcpp24-how-to-fix-the-internet-nostr-reticulum-and-other-ideas",
    "videoId": "TFasLWSk-rI",
    "url": "https://www.youtube.com/watch?v=TFasLWSk-rI",
    "publishedAt": "2024-11-12T12:20:43Z",
    "desc": "The internet is broken. We want free stuff, so we are the product. The datacenters are not free. Our identities, our social graphs, our channels and often our revenue are either owned or passed through intermediaries, who can flip the switch - and we're gone. There are ways to take our online lives back, but it needs a bit of a cypherpunk mindset, and willingness to experiment. Reticulum is a low-level mesh network when the basic Internet infrastructure fails. We can run it in cities over radio. Nostr is a protocol for publishing content, building social graphs and building replacement for Twitter/X, Instagram, but also Meetup, maps-based apps and many other things. And most of it (somehow) works today. If you are a bit cypherpunk and not a normie, come over!\n\n",
    "duration": 3805,
    "name": "How to fix the Internet - Nostr, Reticulum and other ideas",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "juraj-bednar"
    ],
    "storage": {
      "id": "TFasLWSk-rI",
      "path": "/videos/all/TFasLWSk-rI",
      "duration": "3804.581",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/TFasLWSk-rI/source.mp4",
        "hash": "bc599331fba181476305c53f2463c922bbf53c9f7a4bdf7da3d64edd8dff03b0",
        "size": 425304228,
        "resolution": "1920x1080",
        "bitrate": "894299",
        "videoCodec": "avc1",
        "videoBitrate": 761057,
        "audioCodec": "Opus",
        "audioBitrate": 128441
      }
    }
  },
  {
    "id": "QWaHpp70_FU",
    "slug": "hcpp24-what-to-do-with-your-phone-number-in-the-21st-century",
    "videoId": "QWaHpp70_FU",
    "url": "https://www.youtube.com/watch?v=QWaHpp70_FU",
    "publishedAt": "2024-11-12T11:41:30Z",
    "desc": "Phone numbers are as retro today as FAX or disco parties. But what can be done with them in an age where people other than hipsters or steampunkers use them?\n\nThis talk is aimed at people who want to simplify their lives and not use a phone number, but still enjoy some of its benefits while still being able to remain anonymous. I will address why it's important not to use one phone number for everything, how mandatory SIM card registration works, and what alternatives exist for maintaining privacy. Throughout the talk, I will focus on the risks associated with deanonymisation through IMEI numbers and using the same devices in different locations. Examples of solutions include anonymous SIM cards, dedicated mobile phones, SMS forwarding, VoIP numbers, and anonymous eSIM services.\n\n",
    "duration": 3245,
    "name": "What to do with your phone number in the 21st century?",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Michal Kodnar"
    ],
    "storage": {
      "id": "QWaHpp70_FU",
      "path": "/videos/all/QWaHpp70_FU",
      "duration": "3244.701",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/QWaHpp70_FU/source.mp4",
        "hash": "93a7f7b4d24a451c05b381cc9a404b9faaae67d22905c5c0b1fa159b4988ddbc",
        "size": 230752750,
        "resolution": "1920x1080",
        "bitrate": "568934",
        "videoCodec": "vp09",
        "videoBitrate": 436407,
        "audioCodec": "Opus",
        "audioBitrate": 128521
      }
    }
  },
  {
    "id": "3NlJtWcQHP4",
    "slug": "hcpp24-fall-of-bitcoin-commercial-privacy-a-personal-account-of-the-privacy-wars",
    "videoId": "3NlJtWcQHP4",
    "url": "https://www.youtube.com/watch?v=3NlJtWcQHP4",
    "publishedAt": "2024-11-12T11:32:47Z",
    "desc": "The US Government is on the verge to declare self-custodial ownership of Bitcoin a felony. With the latest Tornado Cash and Samourai Wallet arrests, the government wants to force down overly broad and exceeding laws that it pulls out of its rear end constantly, claiming everything is now a EMESSBEE, therefore VASPs are coming to your Frying Pan and you will need a license for that. Samourai Wallet brought me to Hacker's Congress and we have become eternal enemies, but what is the real story behind their arrest and what are our chances for getting out of this mess if the government declares them guilty on all counts? What could happen and what can companies do to either \"comply\" or be subjugated. Can there be profit made in this space, or this is the end? What we can find out by the end of Wasabi Wallet? Those on the front lines brought you HWW coinjoins and they are now over, you can no longer plug in your Trezor to coinjoin safely in the comfort of your homes. What implications this have in general, and what a positive outcome could be for us and the whole general privacy space on Bitcoin?\n\n",
    "duration": 2299,
    "name": "Fall of Bitcoin Commercial Privacy: a personal account of the privacy wars",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Karo Zagorus"
    ],
    "storage": {
      "id": "3NlJtWcQHP4",
      "path": "/videos/all/3NlJtWcQHP4",
      "duration": "2298.701",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/3NlJtWcQHP4/source.mp4",
        "hash": "c5af08608b09cee29e8e4ed62a409eecb784d71529fab0177108c24f17d05635",
        "size": 312883115,
        "resolution": "1920x1080",
        "bitrate": "1088904",
        "videoCodec": "avc1",
        "videoBitrate": 960187,
        "audioCodec": "Opus",
        "audioBitrate": 123757
      }
    }
  },
  {
    "id": "6EH_J8rlG94",
    "slug": "hcpp24-refuse-resist-with-foss-and-heavy-metal",
    "videoId": "6EH_J8rlG94",
    "url": "https://www.youtube.com/watch?v=6EH_J8rlG94",
    "publishedAt": "2024-11-12T12:57:37Z",
    "desc": "Thanks to the Internet, humanity is changing. I want to take you on a journey to understand this change, what types of crowds exist, and how to work with them to change a centralized system (like our current one). Then, I will switch to the FOSS world to see what good YOU can do on a big scale for humankind.\n\nI'll share only examples from my personal experience that worked well and some that failed. There also will be some 🤘 metal music.\n\n",
    "duration": 3098,
    "name": "Refuse, Resist with FOSS and Heavy Metal",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Бого"
    ],
    "storage": {
      "id": "6EH_J8rlG94",
      "path": "/videos/all/6EH_J8rlG94",
      "duration": "3097.061",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/6EH_J8rlG94/source.mp4",
        "hash": "cda6ed8a54eb7bdc53b5344ae8d9d1e58ee7b9b69105b9e857480306cedc0a96",
        "size": 298777093,
        "resolution": "1920x1080",
        "bitrate": "771769",
        "videoCodec": "avc1",
        "videoBitrate": 653686,
        "audioCodec": "Opus",
        "audioBitrate": 113062
      }
    }
  },
  {
    "id": "zoJJ2bue76M",
    "slug": "hcpp24-travel-hacking-for-crypto-digital-nomads",
    "videoId": "zoJJ2bue76M",
    "url": "https://www.youtube.com/watch?v=zoJJ2bue76M",
    "publishedAt": "2024-11-12T11:39:19Z",
    "desc": "The workshop is for EU citizens and aims to explain how it is possible to live a comfortable life as a digital crypto nomad, thanks to your favorite crypto, anywhere in the world, including Europe:\n\nWith no EU residency\nWith no EU bank account\nWith no EU snooping\nWith no taxes in the EU\nWith no European health, social contributions, and other obligations - but with the best International healthcare\n\n",
    "duration": 3894,
    "name": "Travel Hacking for Crypto Digital Nomads",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "wilder"
    ],
    "storage": {
      "id": "zoJJ2bue76M",
      "path": "/videos/all/zoJJ2bue76M",
      "duration": "3893.441",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/zoJJ2bue76M/source.mp4",
        "hash": "1536b4a0edb5735e6dfaf585cecacb148c9b64ec4acfaa548edb104925e48db4",
        "size": 442828798,
        "resolution": "1920x1080",
        "bitrate": "909897",
        "videoCodec": "avc1",
        "videoBitrate": 779235,
        "audioCodec": "Opus",
        "audioBitrate": 125758
      }
    }
  },
  {
    "id": "4rTCekMDVbc",
    "slug": "hcpp24-the-democratic-web",
    "videoId": "4rTCekMDVbc",
    "url": "https://www.youtube.com/watch?v=4rTCekMDVbc",
    "publishedAt": "2024-11-12T11:34:36Z",
    "desc": "If there was any doubt before, the COVID-19 pandemic made it clear: digital life is real life. Our lives exist on the Web no less than they do on the streets. But while the streets are governed by the state, the Internet lacks a formal governing body.\n\nThis has led to a centralized, monopolistic situation where a few large corporations practically govern the web. The result is a Web where users are being manipulated, their privacy ignored, or they live in a state of insecurity of being blocked out of platforms their life depends on. Due to the international nature of the Internet, regulators around the globe face difficulties controlling this situation.\n\nWhat is needed is a model for the web with an internal governance mechanism, controlled by the \"citizens\" of the web (Webizens).\n\nThe core principles of the Democratic Web are as follows.\n1. An alternative web to the current one that includes an internal governance layer.\n2. The governance layer is controlled by Webizens, which are citizens of the Democratic web.\n3. There is a naturalization process for users to become Webizens.\n4. The web is governed in a democratic process by its Webizens.\n\nTechnically this requires an updated HTTP protocol, an online identity system, and a decentralized blockchain-based infrastructure.\n\nFrom the political science side of things, we need an updated model of the Three Branches of Government model (legislature, executive, and judiciary branches) for a global purely online governance process.\n\n",
    "duration": 2492,
    "name": "The Democratic Web",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Neiman"
    ],
    "storage": {
      "id": "4rTCekMDVbc",
      "path": "/videos/all/4rTCekMDVbc",
      "duration": "2491.421",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/4rTCekMDVbc/source.mp4",
        "hash": "5d26bf66c6e217720bdc2233f50d730192056e4cf233913fef8dc962baf875c4",
        "size": 246786924,
        "resolution": "1920x1080",
        "bitrate": "792437",
        "videoCodec": "avc1",
        "videoBitrate": 666858,
        "audioCodec": "Opus",
        "audioBitrate": 120765
      }
    }
  },
  {
    "id": "qfTP27e481Y",
    "slug": "hcpp24-musings-on-our-successes-and-failures",
    "videoId": "qfTP27e481Y",
    "url": "https://www.youtube.com/watch?v=qfTP27e481Y",
    "publishedAt": "2024-11-12T13:02:25Z",
    "desc": "Michael does his yearly wrap-up of the pulse of the community.\n\n",
    "duration": 1311,
    "name": "Musings on our successes and failures",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "exiledsurfer"
    ],
    "storage": {
      "id": "qfTP27e481Y",
      "path": "/videos/all/qfTP27e481Y",
      "duration": "1310.281",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/qfTP27e481Y/source.mp4",
        "hash": "020da07180133a58621e9c20e04e5157780df95f8eeb3382816dfdfd2678163d",
        "size": 444843341,
        "resolution": "1920x1080",
        "bitrate": "2716018",
        "videoCodec": "avc1",
        "videoBitrate": 2589401,
        "audioCodec": "Opus",
        "audioBitrate": 118700
      }
    }
  },
  {
    "id": "yFprpxPtywI",
    "slug": "hcpp24-illusion-of-choice",
    "videoId": "yFprpxPtywI",
    "url": "https://www.youtube.com/watch?v=yFprpxPtywI",
    "publishedAt": "2024-11-12T13:10:33Z",
    "desc": "Every day we make decisions but what good are choices if we can't access all our options? We may feel empowered by believing we've made choices based on our desires and identity, but in reality, most choices are limited by design. Whether it's choosing between a Samsung or an iPhone, using Twitter or Telegram, or preferring Apple over Microsoft, these choices are illusions.\n\nAs mentioned in The Matrix: \"Choice is an illusion, created between those with power, and those without.\"\n\nThose who wish to take away our freedoms, the magicians behind these illusions, present their narrow-minded, cowardly neo-communist worldviews as the norm. They work tirelessly to promote a single path: you will own nothing and you will be happy. To them, privacy and freedom are dangerous tools. Like any narcissist or sociopath, they believe the only way to progress is through absolute control and manipulation. They have gaslighted most of our brothers and sisters into accepting their perverted ideologies and beliefs.\n\nWe reject this notion because we are not limited in our ability to think or imagine. We believe the world can be filled with light and progress without giving up our natural rights to expression and freedom.\n\nJoin me as I share my journey over the last 11 years, including the lessons, experiences, and hardships that have shaped who I am today. Learn from my experiences of living on Bitcoin for 8 years while traveling across 15 countries and 4 continents. A life inspired by the desire for greater freedom and happiness.\n\n",
    "duration": 3517,
    "name": "Illusion of Choice",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "amin-rafiee"
    ],
    "storage": {
      "id": "yFprpxPtywI",
      "path": "/videos/all/yFprpxPtywI",
      "duration": "3516.121",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/yFprpxPtywI/source.mp4",
        "hash": "d358fb42c9c39b68dda79eb35416e63f3c8cf4dd953f5da66dcc9a2ddc1560df",
        "size": 446926017,
        "resolution": "1920x1080",
        "bitrate": "1016862",
        "videoCodec": "avc1",
        "videoBitrate": 899991,
        "audioCodec": "Opus",
        "audioBitrate": 112011
      }
    }
  },
  {
    "id": "XwE1jYUevx4",
    "slug": "hcpp24-one-does-not-simply-try-a-bitcoin-app",
    "videoId": "XwE1jYUevx4",
    "url": "https://www.youtube.com/watch?v=XwE1jYUevx4",
    "publishedAt": "2024-11-12T13:36:13Z",
    "desc": "When writing Bitcoin applications, developers often use test networks to make sure it's working correctly. The general public doesn't know that they even exist though they could find them valuable. The goal of this talk is to spread awareness of test networks, their value beyond development and basics of their use.\n\n",
    "duration": 1029,
    "name": "One does not simply try a Bitcoin app",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "habo"
    ],
    "storage": {
      "id": "XwE1jYUevx4",
      "path": "/videos/all/XwE1jYUevx4",
      "duration": "1028.461",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/XwE1jYUevx4/source.mp4",
        "hash": "ff24c2d779f20eb9f256fd6d3b98bb011bc5aba2b858180edac08971fd5e0a9e",
        "size": 71852763,
        "resolution": "1920x1080",
        "bitrate": "558915",
        "videoCodec": "avc1",
        "videoBitrate": 429823,
        "audioCodec": "Opus",
        "audioBitrate": 121111
      }
    }
  },
  {
    "id": "oFRvY5NcULg",
    "slug": "hcpp24-what-are-we-even-doing-here",
    "videoId": "oFRvY5NcULg",
    "url": "https://www.youtube.com/watch?v=oFRvY5NcULg",
    "publishedAt": "2024-11-12T13:33:22Z",
    "desc": "Crypto was built on a web of trust by like-minded nerds. Today, we don't recognize the field anymore: it's been coopted by lizard-brains and their zero-sum money games. Those not coopted by toxic memes still remember why we started out together. Our mission is not yet fulfilled, the promised land has not yet been reached, all in spite of the positive propaganda eminating from the new \"fintech elite\".\n\nLet's remember why we are here and how we can still save the world from itself. I am here to synthesize a new message of hope. To tell a story that wakes up not only us but everyone who can read the signs.\n\n",
    "duration": 1237,
    "name": "What are we even doing here?",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "florian-glatz"
    ],
    "storage": {
      "id": "oFRvY5NcULg",
      "path": "/videos/all/oFRvY5NcULg",
      "duration": "1236.181",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/oFRvY5NcULg/source.mp4",
        "hash": "169db9052d4de9a90861ab1089cffd4fc357c7019c50d824d2f8a80b54dc1316",
        "size": 298075181,
        "resolution": "1920x1080",
        "bitrate": "1929007",
        "videoCodec": "avc1",
        "videoBitrate": 1805228,
        "audioCodec": "Opus",
        "audioBitrate": 118975
      }
    }
  },
  {
    "id": "CbXlr0M6sCk",
    "slug": "hcpp24-choices-motivation-meaning-traversing-the-time-of-our-lives",
    "videoId": "CbXlr0M6sCk",
    "url": "https://www.youtube.com/watch?v=CbXlr0M6sCk",
    "publishedAt": "2024-11-12T15:45:01Z",
    "desc": "What motivates us to do what we do? How do we find meaning in doing it? What makes us choose what we choose? Can we do better? What is important? Can we thrive and feel excellent, regardless of particular outcomes?\n\nThroughout our lives we tend to go with the flow of what is happening, making choices by default. Where do those choices come from? In the face of rapidly changing and challenging times that we live in, both personal and political, both social and economic, can we find motivation to do what we do? Can we actually improve anything? Can we find and maintain enthusiasm to move forward into the unknown and feel good about our choices, regardless of outcome? Drawing from lessons learned (and re-learned), doing my best to face the challenges while often haphazardly wandering through my 67 years on the planet, this talk will attempt to address these existential, important question that we all face (whether consciously, or not). Along the way, I will ramble on related topics, but bring it all together at the end with insights that I hope you will resonate with, and that I hope may be helpful for all of us in embracing our personal and collective futures.\n\n",
    "duration": 3502,
    "name": "Choices, Motivation, Meaning: Traversing the Time of our Lives",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "mitch-altman"
    ],
    "storage": {
      "id": "CbXlr0M6sCk",
      "path": "/videos/all/CbXlr0M6sCk",
      "duration": "3501.861",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/CbXlr0M6sCk/source.mp4",
        "hash": "1234d0e45b1585bab5c59ca5ad501e54b43a8d9c94e650a17b62817afa3e5680",
        "size": 1155846926,
        "resolution": "1920x1080",
        "bitrate": "2640532",
        "videoCodec": "avc1",
        "videoBitrate": 2518506,
        "audioCodec": "Opus",
        "audioBitrate": 113191
      }
    }
  },
  {
    "id": "QXInVwICggg",
    "slug": "hcpp24-hcpp24",
    "videoId": "QXInVwICggg",
    "url": "https://www.youtube.com/watch?v=QXInVwICggg",
    "publishedAt": "2024-11-13T12:48:51Z",
    "desc": "Join Amir Taaki, Jaromil, and Vecna as they examine the 40-year legacy of free software and its profound impact on society. This engaging panel discusses how open-source principles have shaped digital freedoms and considers the challenges and future of a truly free digital world.\n\n",
    "duration": 4957,
    "name": "Panel discussion: Free software & free society: Examining a 40 year legacy",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "amir-taaki",
      "jaromil",
      "Vecna"
    ],
    "storage": {
      "id": "QXInVwICggg",
      "path": "/videos/all/QXInVwICggg",
      "duration": "4956.121",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/QXInVwICggg/source.mp4",
        "hash": "2ef74a6c91efb43534c2790f6fffe8164256fa76571ae692ca77408e4723fc09",
        "size": 1534741263,
        "resolution": "1920x1080",
        "bitrate": "2477327",
        "videoCodec": "avc1",
        "videoBitrate": 2358096,
        "audioCodec": "Opus",
        "audioBitrate": 114435
      }
    }
  },
  {
    "id": "HmOw73tYzKI",
    "slug": "hcpp24-without-permission-with-programmable-cryptography",
    "videoId": "HmOw73tYzKI",
    "url": "https://www.youtube.com/watch?v=HmOw73tYzKI",
    "publishedAt": "2024-11-12T15:00:45Z",
    "desc": "There's a war on general computation, software is eating the world and privacy is dead. Who owns your data and what do they do with it?\n\nZero Knowledge Proofs are magic. In recent years, they've become both more mature and popular. More broadly, programmable cryptography gives us rich and novel ways to interact with and make cryptographic claims. You know, the stuff that our digital life is made up of.\n\nOne underappreciated aspect of programmable cryptography is its permission-less nature. As long as there's cryptographic matter somewhere, we can use it.\n\nWe'll look into novel tech like OpenPassport, TLSNotary, ZK Email, and ZKP2P to see what we can do with programmable cryptography. It is our data. Let's use it.\n\nThe future is here but unevenly distributed. Let's follow the magic and see where it takes us.\n\n",
    "duration": 2602,
    "name": "Without permission, with programmable cryptography",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Oskar Thoren"
    ],
    "storage": {
      "id": "HmOw73tYzKI",
      "path": "/videos/all/HmOw73tYzKI",
      "duration": "2602.021",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/HmOw73tYzKI/source.mp4",
        "hash": "81bc0f3cea3a1967f52b4ff980fec091ebc9666cce8d1b27df58b60aeadf5b70",
        "size": 277972676,
        "resolution": "1920x1080",
        "bitrate": "854636",
        "videoCodec": "vp09",
        "videoBitrate": 731333,
        "audioCodec": "Opus",
        "audioBitrate": 119299
      }
    }
  },
  {
    "id": "_I_vLL-mA5o",
    "slug": "hcpp24-how-to-hack-the-world-2024",
    "videoId": "_I_vLL-mA5o",
    "url": "https://www.youtube.com/watch?v=_I_vLL-mA5o",
    "publishedAt": "2024-11-12T15:29:15Z",
    "desc": "These efforts of ours go far beyond computer systems: we have a whole world to hack. Our model of golden-ruled decentralization is a fundamentally better way of organizing human life than the regimentation that has been thrust upon us; it not only harmonizes with what we are but improves us rather than damaging us, as the dominating system has for so long.\n\n",
    "duration": 3539,
    "name": "How To Hack The World (2024)",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "paul-rosenberg"
    ],
    "storage": {
      "id": "_I_vLL-mA5o",
      "path": "/videos/all/_I_vLL-mA5o",
      "duration": "3538.841",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/_I_vLL-mA5o/source.mp4",
        "hash": "99743e2746cabbccc217f862fe2bab8cd7df01a248387e1e90250046c6cb3f15",
        "size": 230210795,
        "resolution": "1920x1080",
        "bitrate": "520421",
        "videoCodec": "vp09",
        "videoBitrate": 409291,
        "audioCodec": "Opus",
        "audioBitrate": 107125
      }
    }
  },
  {
    "id": "PhO7TflQjpg",
    "slug": "hcpp24-hardcore-cypherpunk-values",
    "videoId": "PhO7TflQjpg",
    "url": "https://www.youtube.com/watch?v=PhO7TflQjpg",
    "publishedAt": "2024-11-12T16:02:34Z",
    "desc": "In an era where digital privacy, decentralization, and resistance to authority are under siege, \"Hardcore Cypherpunk Values\" revisits the uncompromising principles of the Cypherpunk movement. As cryptography becomes commodified and blockchain technologies scale, many core values are being diluted by corporate interests, state regulations, and user complacency. This talk cuts through the noise, returning to the radical origins of Cypherpunk ideals, exploring why today, more than ever, we must reclaim the \"hardcore\" ethos that once defined digital resistance.\n\n",
    "duration": 3645,
    "name": "Hardcore Cypherpunk Values",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "matthias-tarasiewicz"
    ],
    "storage": {
      "id": "PhO7TflQjpg",
      "path": "/videos/all/PhO7TflQjpg",
      "duration": "3644.541",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/PhO7TflQjpg/source.mp4",
        "hash": "ee561f47982e538e49fd5d8973d0e68545c1c6d5a5b78cdc66f69807904f6356",
        "size": 411126961,
        "resolution": "1920x1080",
        "bitrate": "902450",
        "videoCodec": "avc1",
        "videoBitrate": 798646,
        "audioCodec": "Opus",
        "audioBitrate": 96099
      }
    }
  },
  {
    "id": "6TD6mbSHles",
    "slug": "hcpp24-assangedao-freed-julian-assange-by-all-means-necessary-mission-accomplished",
    "videoId": "6TD6mbSHles",
    "url": "https://www.youtube.com/watch?v=6TD6mbSHles",
    "publishedAt": "2024-11-13T13:30:18Z",
    "desc": "In late 2021, while Julian Assange bravely endured the harsh conditions of England’s supermax Belmarsh prison, with his health and legal situation rapidly deteriorating, a group of crypto-native cypherpunks united to fight for his freedom. Harnessing crypto’s most powerful tools for coordination and capital formation, we raised more than 17k ETH by forming a DAO with one goal: to free Assange by any means necessary. The AssangeDAO funds were used to cover all of Assange's legal costs and support many campaigns.\n\nWithin 2 years, Assange was freed from prison. AssangeDAO became the first DAO in history to achieve a tangible, high-stakes, real-world goal: freeing Assange. His freedom today would not have been possible without the contributions of the 10,000 anons behind this effort. Yet, while the world celebrates Assange’s lawyers and digital rights groups, the contribution of AssangeDAO has remained largely unrecognized. Its story is still untold.\n\nThis is a small attempt to do justice to AssangeDAO, its extraordinary achievement, and the ongoing challenges it continues to face.\n\n",
    "duration": 3802,
    "name": "AssangeDAO freed Julian Assange by all means necessary! Mission accomplished?",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "silke-noa"
    ],
    "storage": {
      "id": "6TD6mbSHles",
      "path": "/videos/all/6TD6mbSHles",
      "duration": "3801.141",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/6TD6mbSHles/source.mp4",
        "hash": "acc815ed26e45209b7f47069051551421879b79106e50be999ef02638ba78902",
        "size": 400012531,
        "resolution": "1920x1080",
        "bitrate": "841879",
        "videoCodec": "avc1",
        "videoBitrate": 727871,
        "audioCodec": "Opus",
        "audioBitrate": 105975
      }
    }
  },
  {
    "id": "ouq68bBp_dI",
    "slug": "hcpp24-darkfi-anonymous-apps-chat-daos-swaps-payments",
    "videoId": "ouq68bBp_dI",
    "url": "https://www.youtube.com/watch?v=ouq68bBp_dI",
    "publishedAt": "2024-11-12T13:30:43Z",
    "desc": "",
    "duration": 4637,
    "name": "DarkFi Anonymous Apps: Chat, DAOs, Swaps, Payments",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "amir-taaki"
    ],
    "storage": {
      "id": "ouq68bBp_dI",
      "path": "/videos/all/ouq68bBp_dI",
      "duration": "4636.821",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/ouq68bBp_dI/source.mp4",
        "hash": "49c08c428970ec7471591ba80bde9a925f027d2f64c5b09906a4d900a34f300e",
        "size": 939473312,
        "resolution": "1920x1080",
        "bitrate": "1620892",
        "videoCodec": "vp09",
        "videoBitrate": 1505521,
        "audioCodec": "Opus",
        "audioBitrate": 108975
      }
    }
  },
  {
    "id": "NksJf8s0Vvg",
    "slug": "hcpp24-economic-dao-governance-a-contestable-control-approach",
    "videoId": "NksJf8s0Vvg",
    "url": "https://www.youtube.com/watch?v=NksJf8s0Vvg",
    "publishedAt": "2024-11-12T16:04:04Z",
    "desc": "In this article, we propose a new form of DAO governance that uses a sequential auction mechanism to overcome entrenched control issues that have emerged for DAOs by creating a regime of temporary contestable control. The mechanism avoids potential public choice problems inherent in voting approaches but at the same time provides a vehicle that can enhance and secure value that inheres to DAO voting and other DAO non-market governance procedures. It is robust to empty voting and is code-feasible. It facilitates the ability of DAOs to meet their normative and operational goals in the face of diverse regulatory approaches. Designed to shift control to the party with the most promising business plan, at the same time it distributes social surplus in a way that tends to promote investment by other parties.\n\n",
    "duration": 3348,
    "name": "Economic DAO Governance: A Contestable Control Approach",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Jeff Strnad"
    ],
    "storage": {
      "id": "NksJf8s0Vvg",
      "path": "/videos/all/NksJf8s0Vvg",
      "duration": "3347.701",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/NksJf8s0Vvg/source.mp4",
        "hash": "076ce1c084efb053f42b79cd2a232dbafad033e6f4a61b2c11097861b5aa8fc0",
        "size": 260216661,
        "resolution": "1920x1080",
        "bitrate": "621840",
        "videoCodec": "avc1",
        "videoBitrate": 515349,
        "audioCodec": "Opus",
        "audioBitrate": 98504
      }
    }
  },
  {
    "id": "27LALVmNhEY",
    "slug": "hcpp24-hcpp24",
    "videoId": "27LALVmNhEY",
    "url": "https://www.youtube.com/watch?v=27LALVmNhEY",
    "publishedAt": "2024-11-12T19:43:10Z",
    "desc": "The next 500 years will be an era of reforestation, the restoration of power in communities, and the re-empowerment of society. DarkFi helps us get there.\n\n",
    "duration": 3851,
    "name": "DarkFi: 500 Year Forest Dynasty",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Rachel-Rose O'Leary|rachel-rose"
    ],
    "storage": {
      "id": "27LALVmNhEY",
      "path": "/videos/all/27LALVmNhEY",
      "duration": "3850.581",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/27LALVmNhEY/source.mp4",
        "hash": "53ed4ce168e334f9caf9d2a169593fcf066bce6c342a4a1b295c6f87c05febc1",
        "size": 492908516,
        "resolution": "1920x1080",
        "bitrate": "1024071",
        "videoCodec": "avc1",
        "videoBitrate": 903243,
        "audioCodec": "Opus",
        "audioBitrate": 112706
      }
    }
  },
  {
    "id": "UXznirqcBd4",
    "slug": "hcpp24-corruption-kyc-and-the-cost-of-compliance",
    "videoId": "UXznirqcBd4",
    "url": "https://www.youtube.com/watch?v=UXznirqcBd4",
    "publishedAt": "2024-11-12T16:06:01Z",
    "desc": "Trillions of dollars in illicit financial flows slosh around our financial system today, facilitated by the most powerful centralized institutions. Current efforts to address IFFs are ineffective and result in harmful side effects for some of the most vulnerable in society. In this talk, we investigate the causes and impact of IFFs. Despite what certain bankers and politicians might have told you, the transparency and programmability of cryptocurrencies are a solution to, not a cause of, the problem.\n\n",
    "duration": 3638,
    "name": "Corruption, KYC and the Cost of Compliance",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "jarrad-hope"
    ],
    "storage": {
      "id": "UXznirqcBd4",
      "path": "/videos/all/UXznirqcBd4",
      "duration": "3637.141",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/UXznirqcBd4/source.mp4",
        "hash": "6d6a59d363cc7329bf95684fd225e4675aa2893a3aa4f2d99600456efa6e0f75",
        "size": 476084139,
        "resolution": "1920x1080",
        "bitrate": "1047161",
        "videoCodec": "avc1",
        "videoBitrate": 922818,
        "audioCodec": "Opus",
        "audioBitrate": 119530
      }
    }
  },
  {
    "id": "m5LDhMiAZgQ",
    "slug": "hcpp24-playing-in-hardcore-mode-where-todays-cypherpunk-technology-falls-short",
    "videoId": "m5LDhMiAZgQ",
    "url": "https://www.youtube.com/watch?v=m5LDhMiAZgQ",
    "publishedAt": "2024-11-12T15:09:59Z",
    "desc": "Using technology is often difficult even without security or privacy considerations. Normal or even fairly robust security and privacy requirements make it even harder to effectively use technology. Yet, most of the time, the there are identified vulnerabilities even if those requirements are met -- these attacks are just considered to be uneconomic or beyond the resources or motivations of the attacker.\n\nWe will discuss some of the higher-than-normal threat environments, situations where due to extreme value of protected assets, other-than-economic factors, or changing technologies and assumptions, normal assumptions about the lengths an attacker will go to don't hold. This is particularly scary for normal users because threats aren't static: what requires a 15 year long well-resourced development program to exploit today might be a hobbyist project to exploit in a few years, after the system and its protection measures are in production and difficult to update.\n\nWhile not everyone is operating in hardcore mode, the vulnerabilities exposed can often be addressed by technological or fundamental changes which benefit everyone, and these changes are often cost-effective when applied globally, leaving everyone but the attackers better off.\n\n",
    "duration": 3396,
    "name": "Playing in Hardcore Mode: Where today's cypherpunk technology falls short",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "ryan-lackey"
    ],
    "storage": {
      "id": "m5LDhMiAZgQ",
      "path": "/videos/all/m5LDhMiAZgQ",
      "duration": "3395.621",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/m5LDhMiAZgQ/source.mp4",
        "hash": "6a93fde7cab70cf2d4dd6c7b7996a0638d59d04afed2ac2e7f4f13be48f980ce",
        "size": 258256592,
        "resolution": "1920x1080",
        "bitrate": "608446",
        "videoCodec": "avc1",
        "videoBitrate": 477367,
        "audioCodec": "Opus",
        "audioBitrate": 122930
      }
    }
  },
  {
    "id": "aTUKPsRxIPM",
    "slug": "hcpp24-hacktivism-and-the-real-crypto-movement",
    "videoId": "aTUKPsRxIPM",
    "url": "https://www.youtube.com/watch?v=aTUKPsRxIPM",
    "publishedAt": "2024-11-12T16:04:46Z",
    "desc": "This intervention draws from 30 years of hacktivism history to trace possible future for a movement that has found into cryptography its most powerful empowerment opportunity. An old cage is rusting: the billion dollar cybersecurity farce, the trusted computing straitjacket, and the paternalist throne of die-hard cyberemperors.\n\nIn the last couple of decades, planetary-scale computation precipitated the ongoing transformation of existing jurisdictions and disciplinary realms, a trend that is both depicted and tackled by the notion of \"algorithmic sovereignty\". This talk will address such transformations with particular attention to the web3/crypto sphere, and propose practical and strategic solutions to develop a space for \"digital commons\", to strengthen freedom against new aggressive forms of human exploitation and centralized control.\n\nDeterminism underpins our power: we want humans to understand machines and not the contrary. We need new trustless models in cybernetics, to fight back against the supremacy of centralized black-box governance. Our technical challenge is to create deterministic conditions for replicable computation and implement algorithms whose mode of operation can be scientifically proven, communicated with simplicity, forked, and debated. Algorithms of dissent.\n\n",
    "duration": 3459,
    "name": "Hacktivism and the real crypto movement",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "jaromil"
    ],
    "storage": {
      "id": "aTUKPsRxIPM",
      "path": "/videos/all/aTUKPsRxIPM",
      "duration": "3458.841",
      "framerate": "25.000",
      "source": {
        "path": "/videos/all/aTUKPsRxIPM/source.mp4",
        "hash": "866b8ed7657f1df74c725a344fc68534706ba853af2df082694bdd19463d6e36",
        "size": 484682532,
        "resolution": "1920x1080",
        "bitrate": "1121029",
        "videoCodec": "avc1",
        "videoBitrate": 997875,
        "audioCodec": "Opus",
        "audioBitrate": 118278
      }
    }
  },
  {
    "id": "rEfTyv-7xNo",
    "slug": "hcpp24-hcpp24",
    "videoId": "rEfTyv-7xNo",
    "url": "https://www.youtube.com/watch?v=rEfTyv-7xNo",
    "publishedAt": "2024-11-13T13:51:48Z",
    "desc": "In this forward-looking panel, Eric Sirion, Max Hillebrand, Max Hampshire, and Liam Eagen dive into the future of freedom technologies. Building on Paul’s concept of “Hacking Ahead” and Max’s insights on freedom tech, the panelists explore the tools and innovations society will need to protect digital freedoms, address path dependencies, and navigate diverse approaches to a more open and autonomous future.\n\n",
    "duration": 3202,
    "name": "Panel discussion: Freedom Technologies",
    "project": "hcpp",
    "event": "hcpp24",
    "people": [
      "Eric Sirion",
      "Max Hillebrand|max-hillebrand",
      "Max Hampshire|max-hampshire",
      "Liam Eagen|liam-eagen"
    ],
    "storage": {
      "id": "rEfTyv-7xNo",
      "path": "/videos/all/rEfTyv-7xNo",
      "duration": "3201.301",
      "framerate": "50.000",
      "source": {
        "path": "/videos/all/rEfTyv-7xNo/source.mp4",
        "hash": "adcd4a2b15904e98ea2763102fcb93fc7809e85959a44a6e8dd3e52b51fe5902",
        "size": 1132680681,
        "resolution": "1920x1080",
        "bitrate": "2830551",
        "videoCodec": "avc1",
        "videoBitrate": 2703427,
        "audioCodec": "Opus",
        "audioBitrate": 119202
      }
    }
  }
]